---
type: NavisworksExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 21
tags: [revit-api, class]
---

# NavisworksExportOptions

`Autodesk.Revit.DB.NavisworksExportOptions` · Revit 2024 · 21 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | NavisworksExportOptions | 2014 | `public NavisworksExportOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSelectedElementIds | 2014 | `public ICollection < ElementId > GetSelectedElementIds ()` |
| Method | SetSelectedElementIds | 2014 | `public void SetSelectedElementIds ( ICollection < ElementId > ids )` |
| Property | ConvertElementProperties | 2014 | `public bool ConvertElementProperties { get ; set ; }` |
| Property | ConvertLights | 2020 | `public bool ConvertLights { get ; set ; }` |
| Property | ConvertLinkedCADFormats | 2020 | `public bool ConvertLinkedCADFormats { get ; set ; }` |
| Property | Coordinates | 2014 | `public NavisworksCoordinates Coordinates { get ; set ; }` |
| Property | DivideFileIntoLevels | 2014 | `public bool DivideFileIntoLevels { get ; set ; }` |
| Property | ExportElementIds | 2014 | `public bool ExportElementIds { get ; set ; }` |
| Property | ExportLinks | 2014 | `public bool ExportLinks { get ; set ; }` |
| Property | ExportParts | 2014 | `public bool ExportParts { get ; set ; }` |
| Property | ExportRoomAsAttribute | 2014 | `public bool ExportRoomAsAttribute { get ; set ; }` |
| Property | ExportRoomGeometry | 2014 | `public bool ExportRoomGeometry { get ; set ; }` |
| Property | ExportScope | 2014 | `public NavisworksExportScope ExportScope { get ; set ; }` |
| Property | ExportUrls | 2014 | `public bool ExportUrls { get ; set ; }` |
| Property | FacetingFactor | 2020 | `public double FacetingFactor { get ; set ; }` |
| Property | FindMissingMaterials | 2014 | `public bool FindMissingMaterials { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Parameters | 2014 | `public NavisworksParameters Parameters { get ; set ; }` |
| Property | ViewId | 2014 | `public ElementId ViewId { get ; set ; }` |